Revit 2024 API
ContinuousRailType.Transition Property
 The transition option of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RailTransitionOption Transition { get; set; }
Visual Basic
Public Property Transition As RailTransitionOption
	Get
	Set
Visual C++
public:
property RailTransitionOption Transition {
	RailTransitionOption get ();
	void set (RailTransitionOption value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace